1. Haz las importaciones necesarias para establecer la conexión y trabajar con Pandas.Establece la conexión usando mysql.connector utilizando try/except por si la conexión devuelve un error.

In [40]:
# Importar librería para la conexión con MySQL
# -----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode


# Importar librerías para manipulación y análisis de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

In [41]:
try:
    cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                                  host='127.0.0.1')
    
    # Intenta crear el esquema "alumnas-promo-h"
    cursor = cnx.cursor()
    cursor.execute("CREATE DATABASE alumnas-promo-h")

    # Cambia a la base de datos "alumnas-promo-h"
    cnx.database = 'alumnas-promo-h'

except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your user name or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)
else:
    cnx.close()

2. Crea un nuevo "schema" llamado "alumnas-promo-X"

In [42]:
try:
    cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                                  host='127.0.0.1')
    
    # Intenta crear el esquema "alumnas-promo-h"
    cursor = cnx.cursor()
    cursor.execute("CREATE DATABASE IF NOT EXISTS `alumnas-promo-h`")

    # Cambia a la base de datos "alumnas-promo-h"
    cnx.database = 'alumnas-promo-h'

except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Something is wrong with your user name or password")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("Database does not exist")
    else:
        print(err)
else:
    cnx.close()

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [43]:

try:
    cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                                  host='127.0.0.1',
                                  database='alumnas-promo-h')
    cursor = cnx.cursor()

    # Define la estructura de la tabla
    create_table_query = """
    CREATE TABLE IF NOT EXISTS alumnas (
        id_alumna INT AUTO_INCREMENT PRIMARY KEY,
        nombre VARCHAR(255),
        apellidos VARCHAR(255),
        ciudad VARCHAR(255),
        telefono VARCHAR(20)
    )
    """
    # Ejecuta la consulta para crear la tabla
    cursor.execute(create_table_query)
    
except mysql.connector.Error as err:
    print("Error:", err)

finally:
    # Cierra la conexión
    cursor.close()
    cnx.close()

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [44]:

cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                                  host='127.0.0.1',
                                  database='alumnas-promo-h')
cursor = cnx.cursor()

# Consulta SQL para insertar datos en la tabla
insert_query = """
INSERT INTO alumnas (nombre, apellidos, ciudad, telefono)
VALUES (%s, %s, %s, %s)
"""

# Lista de datos de ejemplo para insertar
data = [
        ("Ana", "García Pérez", "Madrid", "123456789"),
        ("María", "López Martínez", "Barcelona", "987654321"),
        ("Laura", "Fernández Gómez", "Sevilla", "654987321"),
        ("Sofía", "Martín Sánchez", "Madrid", "321456987"),
        ("Lucía", "Díaz Rodríguez", "Barcelona", "789654123"),
        ("Elena", "González López", "Málaga", "456123789"),
        ("Carmen", "Sánchez Fernández", "Alicante", "852369741"),
        ("Paula", "Martínez García", "Madrid", "369852147"),
        ("Alba", "Pérez Martín", "Barcelona", "147852369"),
        ("Marta", "Rodríguez Ruiz", "Granada", "963852741")
    ]



# Ejecuta la consulta para insertar datos
cursor.executemany(insert_query, data)
    
# Confirma la transacción
cnx.commit()


cnx.close()

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [45]:
# Establece la conexión a la base de datos
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                                  host='127.0.0.1',
                                  database='alumnas-promo-h')
cursor = cnx.cursor()

# Realiza la consulta SQL para seleccionar todos los registros de la tabla "alumnas"
query = "SELECT * FROM alumnas"

# Ejecuta la consulta
cursor.execute(query)

# Obtiene todos los resultados de la consulta
results = cursor.fetchall()

# Obtiene los nombres de las columnas del cursor
column_names = [desc[0] for desc in cursor.description]

# Crea un DataFrame con los resultados y los nombres de las columnas
df = pd.DataFrame(results, columns=column_names)

cnx.close()

In [46]:
# Mostrando el dataframe
df

   id_alumna  nombre          apellidos     ciudad   telefono
0          1     Ana       García Pérez     Madrid  123456789
1          2   María     López Martínez  Barcelona  987654321
2          3   Laura    Fernández Gómez    Sevilla  654987321
3          4   Sofía     Martín Sánchez     Madrid  321456987
4          5   Lucía     Díaz Rodríguez  Barcelona  789654123
5          6   Elena     González López     Málaga  456123789
6          7  Carmen  Sánchez Fernández   Alicante  852369741
7          8   Paula    Martínez García     Madrid  369852147
8          9    Alba       Pérez Martín  Barcelona  147852369
9         10   Marta     Rodríguez Ruiz    Granada  963852741

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [47]:
# los 3 primeros registros

df.head(3)

   id_alumna nombre        apellidos     ciudad   telefono
0          1    Ana     García Pérez     Madrid  123456789
1          2  María   López Martínez  Barcelona  987654321
2          3  Laura  Fernández Gómez    Sevilla  654987321

In [48]:
# los 3 ultimos registros

df.tail(3)

   id_alumna nombre        apellidos     ciudad   telefono
7          8  Paula  Martínez García     Madrid  369852147
8          9   Alba     Pérez Martín  Barcelona  147852369
9         10  Marta   Rodríguez Ruiz    Granada  963852741

7. ¿Hay registros duplicados?

In [49]:
# Hay duplicados
df.duplicated().sum()

0

### Bonus:

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [50]:
# Establece la conexión a la base de datos
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='alumnas-promo-h')
cursor = cnx.cursor()

# Realiza la consulta SQL para seleccionar las diferentes ciudades
query = "SELECT DISTINCT ciudad FROM alumnas"

# Ejecuta la consulta
cursor.execute(query)

# Obtiene todos los resultados de la consulta
results = cursor.fetchall()

# Cierra el cursor y la conexión
cursor.close()
cnx.close()

# Convierte los resultados en una lista de ciudades
ciudades = [result[0] for result in results]

# Imprime la lista de ciudades
print(ciudades)

['Madrid', 'Barcelona', 'Sevilla', 'Málaga', 'Alicante', 'Granada']

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [51]:
import mysql.connector
import pandas as pd

# Establece la conexión a la base de datos
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1',
                              database='alumnas-promo-h')

# Consulta para seleccionar las alumnas de Madrid
query_madrid = "SELECT * FROM alumnas WHERE ciudad = 'Madrid'"
cursor_madrid = cnx.cursor()
cursor_madrid.execute(query_madrid)
results_madrid = cursor_madrid.fetchall()
column_names_madrid = [desc[0] for desc in cursor_madrid.description]
df_madrid = pd.DataFrame(results_madrid, columns=column_names_madrid)

# Consulta para seleccionar las alumnas de Barcelona
query_barcelona = "SELECT * FROM alumnas WHERE ciudad = 'Barcelona'"
cursor_barcelona = cnx.cursor()
cursor_barcelona.execute(query_barcelona)
results_barcelona = cursor_barcelona.fetchall()
column_names_barcelona = [desc[0] for desc in cursor_barcelona.description]
df_barcelona = pd.DataFrame(results_barcelona, columns=column_names_barcelona)

# Cierra los cursores
cursor_madrid.close()
cursor_barcelona.close()

# Cierra la conexión a la base de datos
cnx.close()

In [52]:
# Primera tabla

df_madrid

   id_alumna nombre        apellidos  ciudad   telefono
0          1    Ana     García Pérez  Madrid  123456789
1          4  Sofía   Martín Sánchez  Madrid  321456987
2          8  Paula  Martínez García  Madrid  369852147

In [53]:
# Segunda tabla
df_barcelona

   id_alumna nombre       apellidos     ciudad   telefono
0          2  María  López Martínez  Barcelona  987654321
1          5  Lucía  Díaz Rodríguez  Barcelona  789654123
2          9   Alba    Pérez Martín  Barcelona  147852369